wegam/STM32F10xUSBW/Examples/APP/SPI_FLASH.C
//	free(SPI_BUFFER);						//释放动态空间
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void SPI_FLASH_Conf(SPI_FLASH_TypeDef *SPI_Conf)
{
//	#define USB_TEST_BD				//USB_TEST板
//	#define CMSIS_CDC_BD			//CMSIS-CDC板
	#ifdef	USB_TEST_BD
	SPI_Conf->SPIx=SPI2;
	SPI_Conf->SPI_CS_PORT=GPIOC;
	SPI_Conf->SPI_CS_PIN=GPIO_Pin_8;	
	SPI_Conf->SPI_BaudRatePrescaler_x=SPI_BaudRatePrescaler_64;
	
	#else
	
	SPI_Conf->SPIx=SPI1;
	SPI_Conf->SPI_CS_PORT=GPIOA;
	SPI_Conf->SPI_CS_PIN=GPIO_Pin_4;	
	SPI_Conf->SPI_BaudRatePrescaler_x=SPI_BaudRatePrescaler_2;
	
	#endif
	
	SPI_FLASH_ConfigurationNR(SPI_Conf);				//普通SPI接口配置
	SPI_FLASH_GetInfo(SPI_Conf);		//获取FLASH信息---根据ID确定FLASH型号，配置页大小，扇区大小，块大小参数

}


/*******************************************************************************
* Function Name  : SPI_FLASH_PageWrite
* Description    : Writes more than one byte to the FLASH with a single WRITE
*                  cycle(Page WRITE sequence). The number of byte can't exceed
*                  the FLASH page size.
* Input          : - pBuffer : pointer to the buffer  containing the data to be
*                    written to the FLASH.
*                  - WriteAddr : FLASH's internal address to write to.
*                  - NumByteToWrite : number of bytes to write to the FLASH,
*                    must be equal or less than "SPI_FLASH_PageSize" value.
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_PageWrite(SPI_FLASH_TypeDef *SPI_Conf,u8* pBuffer, u32 WriteAddr, u16 NumByteToWrite)	//FLASH写一页数据
{
	SPI_FLASH_WaitForWriteEnd(SPI_Conf);									//等待FLASH写完成
	SPI_FLASH_WriteEnable(SPI_Conf);											//0x06写使能
	
  SPI_FLASH_ENALBE(SPI_Conf);														//SPI_FLASH_使能
	
  SPI_FLASH_WriteReadByte(SPI_Conf,Flash_WPAGE);											//页写命令
  SPI_FLASH_WriteReadByte(SPI_Conf,(WriteAddr & 0xFF0000) >> 16);		//写入高8位地址
	SPI_FLASH_WriteReadByte(SPI_Conf,(WriteAddr & 0xFF00) >> 8);				//写入中间8位地址
  SPI_FLASH_WriteReadByte(SPI_Conf,WriteAddr & 0xFF);								//写入低8位地址
	
  while (NumByteToWrite--)		//开始写入数据，直到写完
  {
    SPI_FLASH_WriteReadByte(SPI_Conf,*pBuffer);				//写入数据
    pBuffer++;
  }
	SPI_FLASH_DISALBE(SPI_Conf);											//SPI_FLASH_关闭
	
  SPI_FLASH_WaitForWriteEnd(SPI_Conf);						//等待写入完成
	
}
/*******************************************************************************
* Function Name  : SPI_FLASH_BufferWrite
* Description    : Writes block of data to the FLASH. In this function, the
*                  number of WRITE cycles are reduced, using Page WRITE sequence.
* Input          : - pBuffer : pointer to the buffer  containing the data to be
*                    written to the FLASH.
*                  - WriteAddr : FLASH's internal address to write to.
*                  - NumByteToWrite : number of bytes to write to the FLASH.
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_BufferWrite(SPI_FLASH_TypeDef *SPI_Conf,u8* pBuffer, u32 WriteAddr, u16 NumByteToWrite)
{
  u8 NumOfPage = 0, NumOfSingle = 0, Addr = 0, count = 0, temp = 0;
	u32	SPI_FLASH_PageSize=SPI_Conf->SPI_FLASH_PageSize;		//获取此芯片的页大小
	
  Addr = WriteAddr % SPI_FLASH_PageSize;							//计算页地址是否对齐，可以整除则对齐
  count = SPI_FLASH_PageSize - Addr;									//计算页内剩余空间大小（例：页大小256，地址256，则WriteAddr % SPI_FLASH_PageSize==1；在页内剩余255个存储空间）
  NumOfPage =  NumByteToWrite / SPI_FLASH_PageSize;		//计算需要用到的页数量
  NumOfSingle = NumByteToWrite % SPI_FLASH_PageSize;	//计算剩余不完整页需要写入的数量

  if (Addr == 0) 					/* WriteAddr is SPI_FLASH_PageSize aligned  */	//页地址对齐
  {
    if (NumOfPage == 0) 	/* NumByteToWrite < SPI_FLASH_PageSize */				//数据不到一页
    {
      SPI_FLASH_PageWrite(SPI_Conf,pBuffer, WriteAddr, NumByteToWrite);
    }
    else /* NumByteToWrite > SPI_FLASH_PageSize */												//写入的数据大于一页
    {
      while (NumOfPage--)
      {
        SPI_FLASH_PageWrite(SPI_Conf,pBuffer, WriteAddr, SPI_FLASH_PageSize);
        WriteAddr +=  SPI_FLASH_PageSize;		//地址加一页
        pBuffer += SPI_FLASH_PageSize;			//缓冲区数据地址偏移一页
      }

      SPI_FLASH_PageWrite(SPI_Conf,pBuffer, WriteAddr, NumOfSingle);		//写入剩余非整页倍数据
    }
  }
  else 				/* WriteAddr is not SPI_FLASH_PageSize aligned  */				//页地址未对齐
  {
    if (NumOfPage == 0) /* NumByteToWrite < SPI_FLASH_PageSize */				//数据不到一页大小
    {
      if (NumOfSingle > count) /* (NumByteToWrite + WriteAddr) > SPI_FLASH_PageSize */			//需要跨页（需要写入的数据大于页内剩余空间）
      {
        temp = NumOfSingle - count;		//计算下一页待写入的数据个数（总数-当前页空间==下一页待写入的数据个数）

        SPI_FLASH_PageWrite(SPI_Conf,pBuffer, WriteAddr, count);	//将当前页空间写满
        WriteAddr +=  count;					//地址+
        pBuffer += count;

        SPI_FLASH_PageWrite(SPI_Conf,pBuffer, WriteAddr, temp);		//将剩余的数据写入下一页
      }
      else		//不需要跨页
      {
        SPI_FLASH_PageWrite(SPI_Conf,pBuffer, WriteAddr, NumByteToWrite);		//不需要跨页（剩余的空间足够存储当前数据）则直接写入
      }
    }
    else /* NumByteToWrite > SPI_FLASH_PageSize */											//写入的数据大于一页并且地址不对齐
    {
      NumByteToWrite -= count;														//计算将数据写入地址不对齐页后剩余数据个数
      NumOfPage =  NumByteToWrite / SPI_FLASH_PageSize;		//计算剩余数据需要占用的完整页个数
      NumOfSingle = NumByteToWrite % SPI_FLASH_PageSize;	//计算剩余数据中不完整页的数据个数
			
			//------先将前面一部分数据将起始地址不对齐数据写满
      SPI_FLASH_PageWrite(SPI_Conf,pBuffer, WriteAddr, count);
      WriteAddr +=  count;
      pBuffer += count;

      while (NumOfPage--)			//将剩余的整页数据写入FLASH
      {
        SPI_FLASH_PageWrite(SPI_Conf,pBuffer, WriteAddr, SPI_FLASH_PageSize);
        WriteAddr +=  SPI_FLASH_PageSize;
        pBuffer += SPI_FLASH_PageSize;
      }

      if (NumOfSingle != 0)		//判断是否还有剩余（不够一页）待写入
      {
        SPI_FLASH_PageWrite(SPI_Conf,pBuffer, WriteAddr, NumOfSingle);
      }
    }
  }
}

/*******************************************************************************
* Function Name  : SPI_FLASH_BufferRead
* Description    : Reads a block of data from the FLASH.
* Input          : - pBuffer : pointer to the buffer that receives the data read
*                    from the FLASH.
*                  - ReadAddr : FLASH's internal address to read from.
*                  - NumByteToRead : number of bytes to read from the FLASH.
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_BufferRead(
													SPI_FLASH_TypeDef *SPI_Conf,
													u8* pBuffer, 					//数据的数据存储缓冲区
													u32 ReadAddr, 				//读取的起始地址
													u16 NumByteToRead			//待读取字节数
)
{
//	while(SPI_FLASH_ReadStatus(&FLASH_Conf)&WIP_Flag==WIP_Flag);		//读Flash状态寄存器
	SPI_FLASH_WaitForWriteEnd(SPI_Conf);	//等待FLASH写完成
	
	SPI_FLASH_ENALBE(SPI_Conf);								//SPI_FLASH_使能
	
  /* Send "Read from Memory " instruction */
  SPI_FLASH_WriteReadByte(SPI_Conf,Flash_READ);

  /* Send ReadAddr high nibble address byte to read from */
  SPI_FLASH_WriteReadByte(SPI_Conf,(ReadAddr & 0xFF0000) >> 16);
  /* Send ReadAddr medium nibble address byte to read from */
  SPI_FLASH_WriteReadByte(SPI_Conf,(ReadAddr& 0xFF00) >> 8);
  /* Send ReadAddr low nibble address byte to read from */
  SPI_FLASH_WriteReadByte(SPI_Conf,ReadAddr & 0xFF);

  while (NumByteToRead--) /* while there is data to be read */
  {
    /* Read a byte from the FLASH */
    *pBuffer = SPI_FLASH_WriteReadByte(SPI_Conf,Dummy_Byte);
    /* Point to the next location where the byte read will be saved */
    pBuffer++;
  }
	SPI_FLASH_DISALBE(SPI_Conf);											//SPI_FLASH_关闭
}


