wegam/STM32F10xUSBW/Examples/APP/SPI_FLASH.C
/*******************************************************************************
* Function Name  : SPI_FLASH_SectorErase
* Description    : Erases the specified FLASH sector.
* Input          : SectorAddr: address of the sector to erase.
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_SectorErase(SPI_FLASH_TypeDef *SPI_Conf,u32 SectorAddr)
{	
  /* Send write enable instruction */
	SPI_FLASH_WaitForWriteEnd(SPI_Conf);		//等待FLASH写完成
  SPI_FLASH_WriteEnable(SPI_Conf);				//写使能
	
  SPI_FLASH_ENALBE(SPI_Conf);								//SPI_FLASH_使能
  /* Send Sector Erase instruction */
  SPI_FLASH_WriteReadByte(SPI_Conf,Flash_SE);
  /* Send SectorAddr high nibble address byte */
  SPI_FLASH_WriteReadByte(SPI_Conf,(SectorAddr & 0xFF0000) >> 16);
  /* Send SectorAddr medium nibble address byte */
  SPI_FLASH_WriteReadByte(SPI_Conf,(SectorAddr & 0xFF00) >> 8);
  /* Send SectorAddr low nibble address byte */
  SPI_FLASH_WriteReadByte(SPI_Conf,SectorAddr & 0xFF);
	
	SPI_FLASH_DISALBE(SPI_Conf);							//SPI_FLASH_关闭;
	
  /* Wait the end of Flash writing */
  SPI_FLASH_WaitForWriteEnd(SPI_Conf);	
}

/*******************************************************************************
* Function Name  : SPI_FLASH_BulkErase
* Description    : Erases the entire FLASH.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_BulkErase(SPI_FLASH_TypeDef *SPI_Conf)
{
  SPI_FLASH_WriteEnable(SPI_Conf);					//FLASH写使能--等待空闲
	SPI_FLASH_WaitForWriteEnd(SPI_Conf);			//等待FLASH写完成--等待空闲
	
	SPI_FLASH_ENALBE(SPI_Conf);								//SPI_FLASH_使能
  SPI_FLASH_WriteReadByte(SPI_Conf,Flash_BE);		//写入块擦除命令
	SPI_FLASH_DISALBE(SPI_Conf);							//SPI_FLASH_关闭	

  SPI_FLASH_WaitForWriteEnd(SPI_Conf);//等待FLASH写完成--等待空闲	
}
/*******************************************************************************
* Function Name  : SPI_FLASH_BulkErase
* Description    : Erases the entire FLASH.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_ChipErase(SPI_FLASH_TypeDef *SPI_Conf)
{
  /* Send write enable instruction */
  SPI_FLASH_WriteEnable(SPI_Conf);
	/* 等待FLASH写完成*/
	SPI_FLASH_WaitForWriteEnd(SPI_Conf);		//等待FLASH写完成
	/* Chip Erase */
	/* Select the FLASH: Chip Select low */
  SPI_FLASH_ENALBE(SPI_Conf);												//SPI_FLASH_使能
	
  /* Send Bulk Erase instruction  */
  SPI_FLASH_WriteReadByte(SPI_Conf,Flash_CE);	//(unsigned char)0x60				//芯片擦除; 整片擦除; 也可以用0XC7	
	
	SPI_FLASH_DISALBE(SPI_Conf);											//SPI_FLASH_关闭
	
  /* Wait the end of Flash writing */
  SPI_FLASH_WaitForWriteEnd(SPI_Conf);	
}































#endif
